app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["body", "new"], ["created_at", "2021-06-01 16:43:47.966149"], ["updated_at", "2021-06-01 16:43:47.966149"]]